import React from 'react';
import styles from './abouttabs.module.scss';

const AboutTabs = () => {
  return (
    <div className={styles.container}>
      <div>
        Данный сайт был создан с целью: Предоставить пользователям возможность
        создавать индивидуальные программы тренировок путем выбора и
        комбинирования различных упражнений и упражнений на основе их целей и
        предпочтений. Он решает следующую проблему: Многие люди ищут эффективные
        тренировки, но сталкиваются с трудностями в составлении сбалансированной
        программы или не знают, какие упражнения выбрать для достижения своих
        целей. Этот сайт предоставляет инструмент, который упрощает и
        автоматизирует процесс создания индивидуальных программ тренировок,
        помогая пользователям составить оптимальные тренировочные планы в
        соответствии с их потребностями и предпочтениями.
      </div>
      <div>
        Регулярное изменение тренировок является важной составляющей
        эффективного тренировочного процесса. Когда организм приспосабливается к
        постоянным тренировкам, прогресс может замедлиться или вообще
        остановиться. Регулярная смена тренировок помогает преодолеть плато и
        стимулирует дальнейший прогресс. Кроме того, разнообразные тренировки
        позволяют активировать различные мышцы и системы организма, способствуя
        более полному и всестороннему развитию.
      </div>
      <div>
        Важно выбирать тренировки и место для тренировок исходя из своих целей,
        предпочтений и доступных ресурсов. Комбинирование тренировок на улице и
        в тренажерном зале может помочь достичь разностороннего физического
        развития и поддержания мотивации. Наш сайт помогает быстро подготовить
        программу для тренировки на день/неделю/месяц
      </div>
    </div>
  );
};

export default AboutTabs;
