'use client';
import React from 'react';
import styles from './faqaccordion.module.scss';

const FaqAccordion = () => {
  const [expanded, setExpanded] = React.useState<string | false>('panel1');

  const handleChange =
    (panel: string) => (event: React.SyntheticEvent, newExpanded: boolean) => {
      setExpanded(newExpanded ? panel : false);
    };

  return (
    <div className={styles.container}>
      <div>
        <p>Как пользоваться конструктором тренировок?</p>
      </div>
      <div>
        <p>
          Ответ: Чтобы использовать конструктор тренировок, откройте сайт и
          выберите желаемые упражнения из предложенного списка. Затем добавьте
          выбранные упражнения в свою программу тренировок, аналогично
          добавлению товаров в корзину. После того, как программа тренировок
          готова, перейдите в раздел `Программа` и выберите опцию для скачивания
          программы в формате PDF.
        </p>
      </div>

      <p>Как добавить упражнение в программу тренировок?</p>

      <div>
        <p>
          Ответ: Чтобы добавить упражнение в программу тренировок, найдите его в
          списке доступных упражнений и нажмите на кнопку `Добавить в мою
          программу`. Упражнение будет автоматически добавлено в вашу программу
          тренировок.
        </p>
      </div>

      <p>Вопрос: Как удалить упражнение из программы тренировок?</p>

      <div>
        <p>
          Ответ: Чтобы удалить упражнение из программы тренировок, обычно на
          сайте конструктора тренировок есть кнопка `Удалить` или аналогичный
          элемент управления рядом с каждым упражнением в программе. Нажмите на
          эту кнопку, чтобы удалить выбранное упражнение из программы
          тренировок.
        </p>
      </div>
      <p>
        Вопрос: Как связаться с поддержкой сайта, если возникли проблемы с
        конструктором тренировок?
      </p>

      <div>
        <p>Ответ: Напишите нам в телеграмм: @je_kart</p>
      </div>
    </div>
  );
};

export default FaqAccordion;
